results_chameleon/vm/disk/disk_vm_16threads_20250912_152435.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      60365.93
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  235.80
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0003s
    total number of events:              603793

Latency (ms):
         min:                                    0.12
         avg:                                    0.26
         max:                                    3.59
         95th percentile:                        0.40
         sum:                               159713.70

Threads fairness:
    events (avg/stddev):           37737.0625/58.17
    execution time (avg/stddev):   9.9821/0.00