results_chameleon/vm/disk/disk_vm_2threads_20250912_152435.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      7778.38
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  30.38
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0001s
    total number of events:              77799

Latency (ms):
         min:                                    0.13
         avg:                                    0.26
         max:                                    2.47
         95th percentile:                        0.34
         sum:                                19937.51

Threads fairness:
    events (avg/stddev):           38899.5000/1104.50
    execution time (avg/stddev):   9.9688/0.00