results_chameleon/vm/disk/disk_vm_4threads_20250912_152435.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      20195.36
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  78.89
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              202028

Latency (ms):
         min:                                    0.11
         avg:                                    0.20
         max:                                    1.68
         95th percentile:                        0.26
         sum:                                39869.66

Threads fairness:
    events (avg/stddev):           50507.0000/531.69
    execution time (avg/stddev):   9.9674/0.00